namespace VoiceVoxCore.Sharp
{
    public enum Speaker
    {
        // v 0.12.0.prev3
        四国めたん_ノーマル = 2,
        四国めたん_あまあま = 0,
        四国めたん_ツンツン = 6,
        四国めたん_セクシー = 5,
        ずんだもん_ノーマル = 3,
        ずんだもん_あまあま = 1,
        ずんだもん_ツンツン = 7,
        ずんだもん_セクシー = 5,
        春日部つむぎ_ノーマル = 8,
        雨晴はう_ノーマル = 10,
        波音リツ_ノーマル = 9,
        玄野武宏_ノーマル = 11,
        白上虎太郎_ノーマル = 12,
        青山龍星_ノーマル = 13,
        冥鳴ひまり_ノーマル = 14,
        九州そら_ノーマル = 16,
        九州そら_あまあま = 15,
        九州そら_ツンツン = 18,
        九州そら_セクシー = 17,
        九州そら_ささやき = 19,

        // それ以降に追加
    }
}
